M2_rk/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pCorr)" 
    {
      solver     PCG;
      tolerance 5e-06;
      relTol     0.001;
      preconditioner DIC;
    }

    "(p|pCorr)Final"
    {
      $p 
      tolerance 5e-06;
      relTol     0;
    }

    U 
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        tolerance       1e-07;
        relTol          0;
    }
}

RungeKutta
{
    scheme          DIRK2;
    nOuter          1;
    nInner          2;
    pnPredCoef      1;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
